[
  {
    "tag": "greeting",
    "patterns": [
      "Hi",
      "Hello",
      "Hey",
      "How are you"
    ],
    "responses": [
      "Hello! How can I help you today?",
      "Hi there, what's on your mind?"
    ]
  },
  {
    "tag": "goodbye",
    "patterns": [
      "Bye",
      "See you later",
      "Goodbye"
    ],
    "responses": [
      "Goodbye!",
      "See you later!",
      "Have a great day!"
    ]
  },
  {
    "tag": "symptom_checker",
    "patterns": [
      "I have a fever, what should I do?",
      "What could cause a sore throat?",
      "I'm feeling dizzy, can you help?"
    ],
    "responses": [
      "For a fever, rest and stay hydrated. If it persists, consult a doctor.",
      "A sore throat could be due to a cold or an infection. Gargle with warm salt water.",
      "Feeling dizzy? Sit down and rest. If it continues, seek medical advice."
    ]
  },
  {
    "tag": "mental_health_support",
    "patterns": [
      "I'm feeling stressed",
      "How can I deal with anxiety?",
      "I need help with my mental health"
    ],
    "responses": [
      "Try deep breathing or mindfulness exercises. Meditation can also help.",
      "Take short breaks and talk to a trusted friend or therapist.",
      "If stress feels overwhelming, consider professional counseling."
    ]
  },
  {
    "tag": "wellness_challenges",
    "patterns": [
      "Can you give me a fitness challenge?",
      "Motivate me to exercise",
      "how to achieve 10000 steps a day?",
      "How can I stay consistent with my goals?"
    ],
    "responses": [
      "Try the 10,000 steps-a-day challenge to keep yourself active!",
      "Remember, every small step counts. You’re doing great!",
      "Set small, achievable goals and reward yourself for completing them."
    ]
  },
  {
    "tag": "sugar_consumption",
    "patterns": [
        "What happens if I eat too much sugar?",
        "Is too much sugar bad for my health?",
        "How can I reduce my sugar intake?",
        "What are the signs of eating too much sugar?",
        "Can too much sugar cause weight gain?",
        "What are healthy alternatives to sugar?"
    ],
    "responses": [
        "Eating too much sugar can lead to weight gain, increased risk of diabetes, tooth decay, and energy crashes.",
        "Yes, excessive sugar consumption can contribute to obesity, heart disease, and insulin resistance.",
        "To reduce sugar intake, try eating more whole foods, reading nutrition labels, and replacing sugary drinks with water or herbal tea.",
        "Signs of too much sugar include frequent cravings, energy crashes, acne, bloating, and trouble focusing.",
        "Yes, consuming too much sugar leads to excess calorie intake, which can result in weight gain over time.",
        "Healthy sugar alternatives include honey, stevia, monk fruit, and natural fruit-based sweeteners."
    ]
},
{
  "tag": "caffeine_consumption",
  "patterns": [
      "What happens if I drink too much coffee?",
      "Is too much caffeine bad for me?",
      "How much caffeine is too much?",
      "Can caffeine cause anxiety?",
      "What are the side effects of too much caffeine?"
  ],
  "responses": [
      "Drinking too much coffee can lead to restlessness, insomnia, increased heart rate, and digestive issues.",
      "Yes, excessive caffeine can cause jitters, headaches, and even increase anxiety levels.",
      "For most adults, consuming over 400 mg of caffeine per day (about 4 cups of coffee) may be too much.",
      "Yes, caffeine stimulates the nervous system, which can lead to increased anxiety or nervousness in some people.",
      "Common side effects of excessive caffeine include difficulty sleeping, dehydration, and dependency on caffeine for energy."
  ]
},
{
  "tag": "junk_food",
  "patterns": [
      "What happens if I eat too much junk food?",
      "Is junk food bad for my health?",
      "How can I stop eating junk food?",
      "Can fast food cause weight gain?",
      "What are healthy alternatives to junk food?"
  ],
  "responses": [
      "Eating too much junk food can lead to weight gain, digestive issues, and an increased risk of chronic diseases.",
      "Yes, junk food is often high in unhealthy fats, sugars, and processed ingredients that can negatively impact your health.",
      "You can reduce junk food cravings by eating more whole foods, staying hydrated, and avoiding processed snacks.",
      "Yes, fast food is typically high in calories and unhealthy fats, which can lead to weight gain if consumed frequently.",
      "Healthy alternatives include homemade smoothies, nuts, fruits, Greek yogurt, and air-popped popcorn instead of chips."
  ]
},
{
  "tag": "screen_time",
  "patterns": [
      "What happens if I use my phone too much?",
      "Can too much screen time affect my sleep?",
      "How can I reduce screen time?",
      "Does screen time cause eye strain?",
      "What are the effects of too much screen time?"
  ],
  "responses": [
      "Excessive screen time can lead to eye strain, poor sleep, and reduced physical activity.",
      "Yes, too much screen exposure—especially before bedtime—can disrupt melatonin production and affect sleep quality.",
      "You can reduce screen time by setting limits, taking breaks, using blue light filters, and engaging in offline activities.",
      "Yes, staring at screens for long periods can cause digital eye strain, headaches, and dry eyes.",
      "Too much screen time can lead to poor posture, reduced focus, and an increased risk of mental fatigue."
  ]
},
  {
    "tag": "fitness_advice",
    "patterns": [
      "How can I lose weight?",
      "What's a good workout routine?",
      "I want to get fit"
    ],
    "responses": [
      "A balanced diet and regular exercise are key to weight loss. Consider consulting a nutritionist or fitness trainer.",
      "A combination of cardio and strength training is ideal. You can find many workout routines online or consult a fitness professional."
    ]
  },
  {
    "tag": "sleep_advice",
    "patterns": [
      "How can I improve my sleep?",
      "I'm having trouble sleeping",
      "What's a good sleep schedule?"
    ],
    "responses": [
      "Establishing a regular sleep schedule, creating a relaxing bedtime routine, and avoiding screens before bed can improve sleep quality.",
      "Consider consulting a healthcare professional if sleep problems persist."
    ]
  },
  {
    "tag": "emergency_information",
    "patterns": [
      "What should I do for a burn?",
      "How do I perform CPR?",
      "Help, I cut myself"
    ],
    "responses": [
      "For minor burns, cool the area with running water and cover it with a clean cloth.",
      "To perform CPR, give 30 chest compressions followed by 2 rescue breaths. Repeat until help arrives.",
      "Clean the wound with water, apply pressure to stop bleeding, and cover with a sterile bandage."
    ]
  },
  {
    "tag": "diet_advice",
    "patterns": [
      "What should I eat to lose weight?",
      "I need a healthy diet plan",
      "What's a balanced diet?",
      "I want to eat healthier."
    ],
    "responses": [
      "A balanced diet includes fruits, vegetables, whole grains, lean proteins, and healthy fats. Consult a registered dietitian for personalized advice.",
      "To lose weight, focus on calorie control and regular exercise."
    ]
  },
  {
    "tag": "hydration_advice",
    "patterns": [
      "How much water should I drink?",
      "I'm dehydrated",
      "What are the signs of dehydration?"
    ],
    "responses": [
      "Aim to drink plenty of water throughout the day. The exact amount varies, but staying hydrated is essential for overall health.",
      "Signs of dehydration include thirst, dry mouth, and fatigue. Drink water to rehydrate."
    ]
  },
  {
    "tag": "yoga_tips",
    "patterns": [
      "What are some basic yoga poses for beginners?",
      "How often should I practice yoga?",
      "What are the benefits of yoga?"
    ],
    "responses": [
      "Some basic yoga poses for beginners include: Mountain Pose, Warrior Pose, Downward-Facing Dog, and Child's Pose. Practice daily, even if it's just for a few minutes.",
      "Yoga offers numerous benefits, including improved flexibility, strength, balance, and stress reduction."
    ]
  },
  {
    "tag": "exercise_tips",
    "patterns": [
      "How much exercise should I do per day?",
      "What are some good beginner workouts?",
      "How often should I do weight training?"
    ],
    "responses": [
      "Aim for at least 30 minutes of moderate-intensity exercise most days of the week. Walking, jogging, biking, and swimming are great options.",
      "Beginners can start with bodyweight exercises like squats, lunges, push-ups, and planks. As you get stronger, you can incorporate weights.",
      "Weight training 2-3 times per week is a good starting point. Focus on compound exercises that work multiple muscle groups."
    ]
  },
  {
    "tag": "acidity",
    "patterns": [
        "What causes acidity?",
        "How can I get rid of acidity?",
        "What are the symptoms of acidity?",
        "Which foods help with acidity?",
        "How to prevent acid reflux?"
    ],
    "responses": [
        "Acidity is often caused by excess stomach acid due to spicy foods, stress, or irregular eating habits.",
        "You can reduce acidity by drinking cold milk, eating bananas, avoiding spicy food, and staying hydrated.",
        "Common symptoms of acidity include heartburn, indigestion, bloating, and a sour taste in the mouth.",
        "Foods like bananas, yogurt, oatmeal, and green vegetables can help soothe acidity.",
        "Prevent acid reflux by eating smaller meals, avoiding lying down after eating, and reducing caffeine intake."
    ]
},
  {
    "tag": "diabetes",
    "patterns": [
      "I have diabetes."
    ],
    "responses": [
      "It's important to manage your diabetes with the guidance of your healthcare provider. Regular check-ups, medication adherence, and lifestyle modifications are crucial. For diabetes, maintaining a healthy diet, regular exercise, and monitoring blood sugar levels are essential."
    ]
  },

  {
    "tag": "high_blood_pressure",
    "patterns": [
      "I have high blood pressure."
    ],
    "responses": [
      "For high blood pressure, a low-sodium diet, regular exercise, and medication as prescribed by your doctor can help control your blood pressure."
    ]
  },

  {
    "tag": "asthma",
    "patterns": [
      "I have asthma."
    ],
    "responses": [
      "For asthma, using an inhaler as prescribed, avoiding triggers, and practicing breathing exercises can help manage symptoms."
    ]
  },
  {
    "tag": "heart_disease",
    "patterns": [
      "I have heart disease."
    ],
    "responses": [
      "For heart disease, a healthy diet, regular exercise, and medication as prescribed by your doctor can reduce the risk of heart attacks and strokes."
    ]
  },
  {
      "tag": "stomach_pain",
      "patterns": [
          "What causes stomach pain?",
          "How can I relieve stomach pain?",
          "What are the common symptoms of stomach pain?",
          "Which foods help with stomach pain?",
          "When should I see a doctor for stomach pain?"
      ],
      "responses": [
          "Stomach pain can be caused by indigestion, gas, acidity, infections, or even stress.",
          "You can relieve stomach pain by drinking warm water, avoiding spicy foods, and taking over-the-counter antacids if needed.",
          "Common symptoms of stomach pain include bloating, nausea, cramps, and discomfort after eating.",
          "Foods like ginger, peppermint tea, bananas, and plain yogurt can help ease stomach pain.",
          "See a doctor if your stomach pain is severe, lasts more than a few days, or is accompanied by fever, vomiting, or blood in stool."
      ]
  },
  {
    "tag": "gratitude",
    "patterns": [
      "I'm not feeling good about myself.",
      "I need a mood boost.",
      "I want to practice gratitude."
    ],
    "responses": [
      "Let's focus on the positive. What are you grateful for today?",
      "Try saying positive affirmations to yourself, such as 'I am capable,' 'I am worthy,' and 'I am loved.'",
      "Keeping a gratitude journal can help you focus on the positive aspects of your life."
    ]
  },
{
  "tag": "late_night_eating",
  "patterns": [
      "Is eating late at night bad?",
      "Can eating before bed make me gain weight?",
      "What are the effects of late-night snacking?",
      "What should I eat if I’m hungry at night?",
      "How can I stop late-night cravings?"
  ],
  "responses": [
      "Eating late at night can affect digestion, disrupt sleep, and lead to weight gain if you consume excess calories.",
      "It depends on what you eat! Unhealthy snacks before bed may contribute to weight gain, while light, nutritious options can be okay.",
      "Late-night snacking can lead to poor digestion, acid reflux, and unnecessary calorie consumption.",
      "If you’re hungry at night, choose light options like a banana, Greek yogurt, or a handful of nuts instead of junk food.",
      "To stop late-night cravings, eat balanced meals during the day, stay hydrated, and brush your teeth early to signal the end of eating."
  ]
},


  {
    "tag": "loneliness",
    "patterns": [
      "I am feeling Stressed.",
      "I feel lonely.",
      "I miss my friends and family.",
      "I'm isolated."
    ],
    "responses": [
      "It's okay to feel lonely sometimes. Reach out to friends and family, or join social groups and clubs to connect with others.",
      "Try volunteering or helping others to feel more connected to your community.",
      "Consider using social media or video calls to stay connected with loved ones."
    ]
  },
  {
    "tag": "healthy_habits",
    "patterns": [
      "I want to improve my lifestyle.",
      "I need help with healthy habits.",
      "I want to eat healthier."
    ],
    "responses": [
      "Start by setting small, achievable goals, like drinking more water or eating more fruits and vegetables.",
      "Create a balanced meal plan and incorporate regular exercise into your routine.",
      "Prioritize sleep, manage stress, and practice mindfulness to improve your overall well-being."
    ]
  },
  {
    "tag": "user_support",
    "patterns": [
      "How do I use this chatbot?",
      "What can you do?",
      "Help me navigate this tool"
    ],
    "responses": [
      "You can ask me about health, fitness, mental well-being, and more. Try typing your question!",
      "I'm here to provide health tips, answer questions, and give recommendations.",
      "Use the menu to explore features like conversation history or health tips."
    ]
  }

]
